1. 업로드 되어있는 sqlite.zip을 다운 및 원하는 경로에 압축 해제하여 폴더 상태로 변경
 
2. Visual Studio 2022 프로그램을 실행, '코드를 사용하지 않고 계속'클릭
 
3. 상단 바에서 '도구' -> '명령줄' -> '개발자 명령 프롬포트' 순으로 클릭하여 이동
 
4. 개발자 명령 프롬프트가 켜졌다면 sqlite폴더의 위치로 이동하기 위해 지정한 경로를 입력하여 이동 (예 : cd /Temp/sqlite )
 
5. sqlite3 sj.db <- 해당 문장을 입력하여 데이터베이스 파일 생성
 
6. [ 테이블 생성 ]
CREATE TABLE people (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    이름 TEXT NOT NULL,
    과목1 INT NOT NULL,
    과목2 INT NOT NULL
);
<-  위 문장을 입력하여 'people'테이블을 생성

7. [ 테이블에 데이터 삽입]
INSERT INTO people (이름, 과목1, 과목2)
VALUES
	('김희철', 66, 55),
	('이광수', 56, 88),
	('강호동', 21, 99);
<- 위 문장을 입력하여 'people'테이블에 3명의 2과목 성적 데이터를 삽입

8. [ 학생별 총점, 평균 출력 ]
SELECT
    id,
    이름,
    과목1,
    과목2,
    과목1 + 과목2 AS 총점,
    (과목1 + 과목2) / 2.0 AS 평균
FROM people;
<- 위 문장을 입력하여 학생별 총점, 평균을 화면에 출력 가능

/* 출력 결과 */
1|김희철|66|55|121|60.5
2|이광수|56|88|144|72.0
3|강호동|21|99|120|60.0

9. [ 과목별 총점 평균 출력 ]
SELECT
    AVG(과목1) AS '과목1 총점 평균',
    AVG(과목2) AS '과목2 총점 평균'
FROM people;
<- 위 문장을 입력하여 과목별 총점 평균을 화면에 출력 가능

/* 출력 결과 */
47.6666666666667|80.6666666666667
